In [46]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
df5 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df5

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [5]:
df_t = df5.iloc[:,1:5]

In [7]:
df_t.transform(lambda x : (x-x.mean())/x.std())

       var1      var2
0 -0.687871 -0.738461
1 -0.299074 -0.263736
2  0.000000 -0.015514
3 -0.328982 -0.235811
4 -0.657963 -0.704331
5  1.973890  1.957853

In [10]:
(df_t.iloc[0,0] - df_t.var1.mean()) / df_t.var1.std()

-0.6878708952377661

In [11]:
df_t.var1.mean()

33.0

In [12]:
df_t.var1.std()

33.436506994600975

In [13]:
df_t.transform(lambda x : np.log(x))

       var1      var2
0  2.302585  4.605170
1  3.135494  5.533389
2  3.496508  5.808142
3  3.091042  5.568345
4  2.397895  4.709530
5  4.595120  6.876265

In [15]:
np.log(23)

3.1354942159291497

In [16]:
df5 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df5

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [17]:
df5.apply(np.sum)

groups    ABCABC
var1         198
var2        2028
dtype: object

In [19]:
df5.var1.sum()

198

In [20]:
df5.groups.sum()

'ABCABC'

In [ ]:
# df5.apply(np.median)

In [21]:
df_numeric = df5.iloc[:,1:3]

In [22]:
df_numeric

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [23]:
df_numeric.apply(np.median)

var1     22.5
var2    257.5
dtype: float64

In [24]:
df_numeric.apply(np.mean)

var1     33.0
var2    338.0
dtype: float64

In [25]:
df_numeric.apply(np.mean, axis=1)

0     55.0
1    138.0
2    183.0
3    142.0
4     61.0
5    534.0
dtype: float64

In [26]:
df5.groupby("groups").apply(np.mean)

        var1   var2
groups
A       16.0  181.0
B       17.0  182.0
C       66.0  651.0

In [27]:
df5

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [28]:
df5.groupby("groups").mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [29]:
df2 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [31]:
def times2(x):
    return x*2

In [32]:
df2["col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [33]:
df2["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [34]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [35]:
df2["col3"].transform(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [36]:
df2["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [37]:
df1 = pd.DataFrame([["a", 9, 25]] * 4, columns=["grp", 'P', 'Q'])
df2 = pd.DataFrame([["b", 9, 25]] * 3, columns=["grp", 'P', 'Q'])
df3 = pd.concat([df1, df2], ignore_index=True)
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [38]:
df3.apply(lambda x : x + x)

  grp   P   Q
0  aa  18  50
1  aa  18  50
2  aa  18  50
3  aa  18  50
4  bb  18  50
5  bb  18  50
6  bb  18  50

In [39]:
df3.apply(lambda y : y + y)

  grp   P   Q
0  aa  18  50
1  aa  18  50
2  aa  18  50
3  aa  18  50
4  bb  18  50
5  bb  18  50
6  bb  18  50

In [40]:
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [41]:
df3.groupby("grp").apply(sum) # apply all values

      grp   P    Q
grp
a    aaaa  36  100
b     bbb  27   75

In [42]:
df3.groupby("grp").transform(sum) # output isdf same index length

    P    Q
0  36  100
1  36  100
2  36  100
3  36  100
4  27   75
5  27   75
6  27   75

In [43]:
df3.transform(lambda x : x.sum())

ValueError: transforms cannot produce aggregated results

In [45]:
df3.groupby("grp").sum()

      P    Q
grp
a    36  100
b    27   75

In [47]:
titanic = sns.load_dataset("titanic")

In [48]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [50]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [51]:
titanic.groupby(["sex","class"])[["survived"]].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [53]:
titanic.groupby(["sex","class"])[["survived"]].agg("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [54]:
titanic.groupby(["sex","class"])[["survived"]].agg("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [56]:
titanic.pivot_table("survived", index = "sex", columns = "class") # Default aggregate func mean

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [57]:
titanic.pivot_table("age", index = "sex", columns ="class") # results are age.mean()

class       First     Second      Third
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

In [58]:
titanic.pivot_table("age", index = "class", columns ="sex") # results are age.mean()

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

In [60]:
age = pd.cut(titanic["age"], [0,18,90])

In [62]:
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [66]:
age = pd.cut(titanic["age"], [0,18,30,50,90])

In [67]:
age.head(15)

0     (18.0, 30.0]
1     (30.0, 50.0]
2     (18.0, 30.0]
3     (30.0, 50.0]
4     (30.0, 50.0]
5              NaN
6     (50.0, 90.0]
7      (0.0, 18.0]
8     (18.0, 30.0]
9      (0.0, 18.0]
10     (0.0, 18.0]
11    (50.0, 90.0]
12    (18.0, 30.0]
13    (30.0, 50.0]
14     (0.0, 18.0]
Name: age, dtype: category
Categories (4, interval[int64]): [(0, 18] < (18, 30] < (30, 50] < (50, 90]]

In [68]:
age = pd.cut(titanic["age"], [0,18,90])

In [69]:
age

0      (18.0, 90.0]
1      (18.0, 90.0]
2      (18.0, 90.0]
3      (18.0, 90.0]
4      (18.0, 90.0]
           ...
886    (18.0, 90.0]
887    (18.0, 90.0]
888             NaN
889    (18.0, 90.0]
890    (18.0, 90.0]
Name: age, Length: 891, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [70]:
titanic.pivot_table("survived", ["sex",age])

                 survived
sex    age
female (0, 18]   0.676471
       (18, 90]  0.782383
male   (0, 18]   0.338028
       (18, 90]  0.180628

In [71]:
titanic.pivot_table("survived", ["sex",age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663